# numpy

In [1]:
import numpy as np

In [4]:
day_number = np.arange(1,11)
steps_walked = [6012,7079,6886,7230,4598,5564,6971,7763,8032,9569]
arr = np.array([day_number,steps_walked])
arr = arr.T
arr

array([[   1, 6012],
       [   2, 7079],
       [   3, 6886],
       [   4, 7230],
       [   5, 4598],
       [   6, 5564],
       [   7, 6971],
       [   8, 7763],
       [   9, 8032],
       [  10, 9569]])

In [5]:
new_arr = arr[:,1] + 2000
arr[:,1]=new_arr
arr

array([[    1,  8012],
       [    2,  9079],
       [    3,  8886],
       [    4,  9230],
       [    5,  6598],
       [    6,  7564],
       [    7,  8971],
       [    8,  9763],
       [    9, 10032],
       [   10, 11569]])

In [6]:
matched = arr[:,1]>9000
matched
new_arr = arr[matched]
new_arr

array([[    2,  9079],
       [    4,  9230],
       [    8,  9763],
       [    9, 10032],
       [   10, 11569]])

In [7]:
sortedarr = arr[arr[:,1].argsort()]
print("sorted 2D numpy array")
print(sortedarr)

sorted 2D numpy array
[[    5  6598]
 [    6  7564]
 [    1  8012]
 [    3  8886]
 [    7  8971]
 [    2  9079]
 [    4  9230]
 [    8  9763]
 [    9 10032]
 [   10 11569]]

# pandas

In [3]:
import pandas as pd
import numpy as np
marks = {'chemistry': [67,90,66,32],'physics': [45,92,72,40],'mathematics': [50,87,81,12],'English': [19,90,72,68]}
marks_df = pd.DataFrame(marks, index = ['subodh','Ram','Abdul','John'])
marks_df

        chemistry  physics  mathematics  English
subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

In [8]:
marks_df['Total'] = marks_df['chemistry'] + marks_df['physics'] + marks_df['mathematics'] + marks_df['English']
marks_df

        chemistry  physics  mathematics  English  Total
subodh         67       45           50       19    181
Ram            90       92           87       90    359
Abdul          66       72           81       72    291
John           32       40           12       68    152

In [9]:
marks_df.drop(columns = 'Total',inplace = True)
marks_df

        chemistry  physics  mathematics  English
subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

In [11]:
new_marks = marks_df + 5
new_marks

        chemistry  physics  mathematics  English
subodh         72       50           55       24
Ram            95       97           92       95
Abdul          71       77           86       77
John           37       45           17       73

In [12]:
new_marks = marks_df + [5,10,10,2]
new_marks

        chemistry  physics  mathematics  English
subodh         72       55           60       21
Ram            95      102           97       92
Abdul          71       82           91       74
John           37       50           22       70

In [13]:
marks_df.apply(np.sum, axis = 0)

chemistry      255
physics        249
mathematics    230
English        249
dtype: int64

In [14]:
marks_df.apply(np.sum, axis = 1)

subodh    181
Ram       359
Abdul     291
John      152
dtype: int64

In [15]:
f = marks_df < 35
marks_df.mask(f, 'fail')

       chemistry  physics mathematics English
subodh        67       45          50    fail
Ram           90       92          87      90
Abdul         66       72          81      72
John        fail       40        fail      68

In [2]:
import numpy as np
import pandas as pd

In [3]:
import pandas as pd
import numpy as np
df = pd.read_csv('auto-mpg.csv')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [4]:
df.loc[(df['mpg'] > 29) & (df['horsepower'] < 93.5) & (df['weight'] < 2500)]

TypeError: '<' not supported between instances of 'str' and 'float'